
using System;

class Program
{
/*24.В массиве хранится информация о баллах, полученных спортсменом-десятиборцем в каждом из десяти видов спорта. 
    Для выхода в следующий этап соревнований общая сумма баллов должна превысить некоторое известное значение. 
    Определить, вышел ли данный спортсмен в следующий этап соревнований.*/
    static void Main()
    {
        int[] bal = { 80, 90, 75, 60, 95, 85, 70, 78, 88, 92 }; // Оголошення та ініціалізація масиву балів у десяти видів спорту 
        int porog = 800; // Порогове значення для виходу в наступний етап соревновань

        int sumb = 0;

        // Обчислюємо загальну суму балів усіх видів спорту
        foreach (int ball in bal)
        {
            sumb += ball;
        }

        // Перевіряємо, чи сума балів більше порогового значення
        if (sumb > porog)
        {
            Console.WriteLine("Спортсмен проходить в наступний етап соревнований."); // Виводимо повідомлення, якщо умова виконується
        }
        else
        {
            Console.WriteLine("Спортсмен не проходить в наступний етап соревнований."); // Виводимо повідомлення, якщо умова не виконується
        }
    }
}
