using System;

class Program
{
    static void Main()
    {
        int[] bal = { 80, 90, 75, 60, 95, 85, 70, 78, 88, 92 }; // Масив балів у десяти видів спорту
        int porog = 800; // Порогове значення для виходу в наступний етап

        int sumb = 0;

        // Обчислюємо загальну суму балів усіх видів спорту
        foreach (int ball in bal)
        {
            sumb += ball;
        }

        // Перевіряємо, чи спортсмен проходить в наступний етап соревновань
        if (sumb > porog)
        {
            Console.WriteLine("Спортсмен проходить в наступний етап соревнований.");
        }
        else
        {
            Console.WriteLine("Спортсмен не проходить в наступний етап соревнований.");
        }
    }
}
