
using System;

class Program
{
/*141.Даны две последовательности целых чисел а1, а2, ..., an и b1, b2, ..., bn. Преобразовать последовательность b1, b2, ..., 
    bn по следующему правилу: если аi ≤ 0, то bi увеличить в 10 раз, в противном случае bi заменить нулем (i = 1, 2, ..., n).*/
    static void Main()
    {
        int[] a = { 2, -3, 5, 0, -7 }; // Оголошення та ініціалізація масиву 'a' з числами
        int[] b = { 10, 20, 30, 40, 50 }; // Оголошення та ініціалізація масиву 'b' з числами

        // Перевіряємо, чи довжина масиву 'a' дорівнює довжині масиву 'b'
        if (a.Length == b.Length)
        {
            // Проходимося по елементах масиву 'a' та масиву 'b' з однаковими індексами
            for (int i = 0; i < a.Length; i++)
            {
                if (a[i] <= 0)
                {
                    b[i] *= 10; // Якщо елемент 'a' менший або дорівнює 0, множимо елемент 'b' на 10
                }
                else
                {
                    b[i] = 0; // Якщо елемент 'a' більший за 0, замінюємо елемент 'b' на 0
                }
            }

            Console.WriteLine("Преобразованный массив b:"); // Виводимо змінений масив 'b'
            foreach (int value in b)
            {
                Console.Write(value + " ");
            }
        }
        else
        {
            Console.WriteLine("Длины массивов a и b должны совпадать."); /* Виводимо повідомлення про те, що довжини масивів не співпадають*/
        }
    }
}
